src/cf/InformationRegisters/вогНапоминанияОСообщениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНапоминанияОСообщениях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/вогСистемаВзаимодействийВызовСервера/Ext/Module.bsl
Процедура ОбработкаКнопокСообщенийДокументаМероприятие(Действие,ИдентификаторСообщения) Экспорт
	
	Документы.CRM_Мероприятие.ОбработкаКнопокСообщений(Действие,ИдентификаторСообщения);	
	
	
КонецПроцедуры


Процедура ДобавитьНапоминаниеДляПолучателейПриОтправкеСообщения(Получатели,Объект,ЗаголовокОбсуждения,ТекстСообщения)   Экспорт
	
	вогСистемаВзаимодействийСервер.ДобавитьНапоминаниеДляПолучателейПриОтправкеСообщения(Получатели,Объект,ЗаголовокОбсуждения,ТекстСообщения);
	
КонецПроцедуры

//Функция возвращает массив навигационных ссылок из непрочитанных напоминаний текущего пользователя
Функция ПолучитьСписокАктивныхНапоминанийТекущегоПользователя() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вогНапоминанияОСообщениях.Контекст КАК Контекст
	               |ИЗ
	               |	РегистрСведений.вогНапоминанияОСообщениях КАК вогНапоминанияОСообщениях
	               |ГДЕ
	               |	вогНапоминанияОСообщениях.Пользователь = &Пользователь
	               |	И НЕ вогНапоминанияОСообщениях.Прочитано ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контекст");
	Возврат Результат;
	
КонецФункции

Процедура ПриЗакрытииФормыОбъекта(URL) экспорт
	
	вогСистемаВзаимодействийСервер.ПриЗакрытииФормыОбъектa(URL);
	
КонецПроцедуры


Процедура вогОткрытиеФормыОбъектаДляНапоминанийОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	вогСистемаВзаимодействийСервер.вогОткрытиеФормыОбъектаДляНапоминанийОбработкаПолученияФормы(Источник,ВидФормы,Параметры,ВыбраннаяФорма,ДополнительнаяИнформация,СтандартнаяОбработка);
	
КонецПроцедуры
